package main;

public class Test {

	public static void main(String[] args) {
		
		/*
		 * [연산자]
		 * 
		 * 산술 연산자:숫자 숫자 =>숫자
		 * +,-,*,/,%
		 * 
		 * 비교 연산자:숫자 숫자 => 논리
		 * <,>,<=,>=,==,!=
		 * 
		 * 논리 연산자: 논리 논리 => 논리
		 * &&, ||,!
		 * 
		 * 증감 연산자: 전위, 후위
		 * ++x, x++, --x, x--
		 * 세미콜린: 한문장 단위 / 한문장을 기준으로 한문장이 끝나기전과 끝난후
		 * 
		 * 복합 대입 연산자
		 * +=, -=, *=, /=, %=
		 * 
		 * 대입 연산자
		 * x= x+1; 
		 * x왼쪽에 있는 값 불러올떄는 주소값을 그대로
		 *  불러오고 x오른쪽에 있는 값 불러오때는 참조해서 불러온다
		 * 
		 * 삼항 연산자
		 * 
		 * 비크,연
		 */
		
		
		int x = 10;
		x= x + 1;
		System.out.println(x++);


	}

}
